In [15]:
#Dependencies
import pandas as pd
import numpy as np

In [2]:
url = 'https://data-class-mars-challenge.s3.amazonaws.com/Mars/index.html'

In [3]:
tables = pd.read_html(url)
tables

[        id terrestrial_date   sol   ls  month  min_temp  pressure
 0        2       2012-08-16    10  155      6     -75.0     739.0
 1       13       2012-08-17    11  156      6     -76.0     740.0
 2       24       2012-08-18    12  156      6     -76.0     741.0
 3       35       2012-08-19    13  157      6     -74.0     732.0
 4       46       2012-08-20    14  157      6     -74.0     740.0
 ...    ...              ...   ...  ...    ...       ...       ...
 1862  1889       2018-02-23  1973  133      5     -78.0     730.0
 1863  1892       2018-02-24  1974  134      5     -77.0     729.0
 1864  1894       2018-02-25  1975  134      5     -76.0     729.0
 1865  1893       2018-02-26  1976  135      5     -77.0     728.0
 1866  1895       2018-02-27  1977  135      5     -77.0     727.0

 [1867 rows x 7 columns]]

In [4]:
df = tables[0]
df.head()

   id terrestrial_date  sol   ls  month  min_temp  pressure
0   2       2012-08-16   10  155      6     -75.0     739.0
1  13       2012-08-17   11  156      6     -76.0     740.0
2  24       2012-08-18   12  156      6     -76.0     741.0
3  35       2012-08-19   13  157      6     -74.0     732.0
4  46       2012-08-20   14  157      6     -74.0     740.0

In [9]:
#How many months exist on Mars?
month_column = df["month"]
max = month_column.max()
print(f"There are {max} months in Mars.")

There are 12 months in Mars.

In [11]:
#How many Martian (and not Earth) days worth of data exist in the scraped dataset?
length_of_dataset = len(df)
print(f"There are {length_of_dataset} Martian days worth of data.")

There are 1867 Martian days worth of data.

In [23]:
#What are the coldest and the warmest months on Mars (at the location of Curiosity)?
month_1_df = df[df['month'] == 1]

        id terrestrial_date   sol  ls  month  min_temp  pressure
304    320       2013-08-01   351   0      1     -75.0     853.0
305    319       2013-08-02   352   0      1     -77.0     854.0
306    323       2013-08-03   353   1      1     -75.0     855.0
307    322       2013-08-04   354   1      1     -75.0     857.0
308    321       2013-08-05   355   2      1     -75.0     857.0
...    ...              ...   ...  ..    ...       ...       ...
1634  1663       2017-07-03  1744  27      1     -78.0     863.0
1635  1664       2017-07-04  1745  28      1     -78.0     865.0
1636  1665       2017-07-05  1746  28      1     -76.0     866.0
1637  1666       2017-07-06  1747  29      1     -79.0     866.0
1638  1668       2017-07-07  1748  29      1     -79.0     867.0

[174 rows x 7 columns]